Revit 2024 API
MemberForces Members
The MemberForces type exposes the following members.
Constructors
Name | Description
MemberForces
 Creates a new instance of MemberForces.
Methods
Name | Description
Dispose
Releases all resources used by the MemberForces
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Force
 The translational forces at relative point position of the element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Moment
 The rotational forces at relative point position of the element.
Start
 Member Forces position on analytical element. True for start, false for end.
See Also
MemberForces Class
Autodesk.Revit.DB.Structure Namespace